src/Documents/ИТСервисы_Задачи/ИТСервисы_Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_Задачи</name>
  <registerRecords>InformationRegister.ИТСервисы_СостоянияЗадач</registerRecords>
  <registerRecords>AccumulationRegister.ИТСервисы_НагрузкаСотрудникаПоЗадачам</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ИТСервисы_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнтеграционныйКонтур</name>
    <attributes>
      <name>UUIDСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenCardURL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененПослеСинхронизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейСинхронизации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийСтатус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_КомандыПроектов/ИТСервисы_КомандыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_КомандыПроектов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЧасовНаПроекте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛимитЧасовВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольВКоманде</name>
    <type>
      <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИТСервисы_Задачи/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала выберите ИТ-Проект!", , "Объект.Проект");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	МассивСотрудников = ПолучитьСотрудниковПроектаНаСервере(Объект.Проект, Объект.Дата);
	Если МассивСотрудников.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В команде этого проекта еще нет сотрудников! Сформируйте команду.");
		Возврат;
	КонецЕсли;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", МассивСотрудников);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элемент);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСотрудниковПроектаНаСервере(Проект, ДатаДок)
	УстДата = ?(ЗначениеЗаполнено(ДатаДок), ДатаДок, ТекущаяДатаСеанса());
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Команды.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ИТСервисы_КомандыПроектов.СрезПоследних(&Период, Проект = &Проект) КАК Команды";
	
	Запрос.УстановитьПараметр("Период", УстДата);
	Запрос.УстановитьПараметр("Проект", Проект);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");	
КонецФункции
